---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/davidwan/Downloads/MRP Project/MRPMinoranalysis.log
  log type:  text
 opened on:   3 Dec 2018, 06:59:58

. * Create log file
. 
. clear

. use "/Users/davidwan/Downloads/MRP Project/NSDUHcleanminorfinal.dta"

. * Use combined NSDUH minor dataset which has been cleaned
. set more off

. 
. drop if minor == 0
(127,029 observations deleted)

. * 126247 adult observerations dropped 
. 
. * Marijuana Use participation in last month
. gen marjmthpart = 1

. replace marjmthpart = 0 if marjmth == 0
(38,173 real changes made)

. 
. * Marijuana Use intesnity in last year
. tab mrdaypyr

  # DAYS USED MARIJUANA/HASHISH PAST 12 |
                                 MONTHS |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      1 |        510        1.24        1.24
                                      2 |        324        0.79        2.03
                                      3 |        249        0.61        2.64
                                      4 |        146        0.36        3.00
                                      5 |        140        0.34        3.34
                                      6 |         67        0.16        3.50
                                      7 |         56        0.14        3.64
                                      8 |         24        0.06        3.70
                                      9 |         14        0.03        3.73
                                     10 |         84        0.20        3.94
                                     11 |          6        0.01        3.95
                                     12 |         15        0.04        3.99
                                     13 |          8        0.02        4.01
                                     14 |          7        0.02        4.03
                                     15 |         50        0.12        4.15
                                     16 |          6        0.01        4.16
                                     17 |          2        0.00        4.17
                                     18 |          2        0.00        4.17
                                     19 |          5        0.01        4.18
                                     20 |         48        0.12        4.30
                                     24 |          3        0.01        4.31
                                     25 |         15        0.04        4.35
                                     26 |          1        0.00        4.35
                                     27 |          4        0.01        4.36
                                     28 |          1        0.00        4.36
                                     30 |         40        0.10        4.46
                                     33 |          1        0.00        4.46
                                     35 |          3        0.01        4.47
                                     37 |          2        0.00        4.47
                                     38 |          2        0.00        4.48
                                     39 |          1        0.00        4.48
                                     40 |          7        0.02        4.50
                                     45 |          7        0.02        4.51
                                     46 |          1        0.00        4.52
                                     50 |          7        0.02        4.53
                                     55 |          2        0.00        4.54
                                     56 |          1        0.00        4.54
                                     60 |          9        0.02        4.56
                                     61 |          1        0.00        4.56
                                     67 |          1        0.00        4.57
                                     68 |          1        0.00        4.57
                                     69 |          1        0.00        4.57
                                     70 |          3        0.01        4.58
                                     80 |          2        0.00        4.58
                                     90 |          4        0.01        4.59
                                     93 |          1        0.00        4.60
                                    100 |         14        0.03        4.63
                                    105 |          1        0.00        4.63
                                    120 |          1        0.00        4.64
                                    122 |          1        0.00        4.64
                                    134 |          1        0.00        4.64
                                    135 |          2        0.00        4.65
                                    140 |          1        0.00        4.65
                                    145 |          1        0.00        4.65
                                    150 |          2        0.00        4.65
                                    155 |          1        0.00        4.66
                                    180 |          2        0.00        4.66
                                    200 |         12        0.03        4.69
                                    220 |          1        0.00        4.69
                                    230 |          2        0.00        4.70
                                    233 |          1        0.00        4.70
                                    250 |          2        0.00        4.71
                                    265 |          1        0.00        4.71
                                    300 |          9        0.02        4.73
                                    320 |          1        0.00        4.73
                                    325 |          1        0.00        4.74
                                    333 |          1        0.00        4.74
                                    335 |          1        0.00        4.74
                                    340 |          1        0.00        4.74
                                    345 |          2        0.00        4.75
                                    350 |          3        0.01        4.75
                                    355 |          1        0.00        4.76
                                    360 |          3        0.01        4.76
                                    364 |          1        0.00        4.77
                                    365 |         25        0.06        4.83
                                    366 |          2        0.00        4.83
      985 - BAD DATA Logically assigned |          8        0.02        4.85
989 - LEGITIMATE SKIP Logically assigne |         42        0.10        4.95
             991 - NEVER USED MARIJUANA |     34,633       84.49       89.45
993 - DID NOT USE MARIJUANA IN THE PAST |      1,240        3.03       92.47
                       994 - DON T KNOW |         36        0.09       92.56
                          997 - REFUSED |         10        0.02       92.59
                            998 - BLANK |          4        0.01       92.60
                  999 - LEGITIMATE SKIP |      3,035        7.40      100.00
----------------------------------------+-----------------------------------
                                  Total |     40,989      100.00

. 
. * Generate an age squared variable
. gen agesq = age * age

. 
. * Generate age dummies (omitted group is 12 years old)
. 
. gen age13 = 0

. replace age13 = 1 if age == 13
(6,889 real changes made)

. 
. gen age14 = 0

. replace age14 = 1 if age == 14
(7,042 real changes made)

. 
. gen age15 = 0

. replace age15 = 1 if age == 15
(7,094 real changes made)

. 
. gen age16 = 0

. replace age16 = 1 if age == 16
(7,008 real changes made)

. 
. gen age17 = 0

. replace age17 = 1 if age == 17
(6,634 real changes made)

. 
. * Probability models for marijuana participation
. 
. reg marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fiftykto
> 75k MEDMJLAW

      Source |       SS           df       MS      Number of obs   =    40,989
-------------+----------------------------------   F(7, 40981)     =     15.07
       Model |  6.73205964         7  .961722805   Prob > F        =    0.0000
    Residual |  2615.80491    40,981  .063829699   R-squared       =    0.0026
-------------+----------------------------------   Adj R-squared   =    0.0024
       Total |  2622.53697    40,988  .063983043   Root MSE        =    .25265

------------------------------------------------------------------------------
 marjmthpart |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tenkorlower |   .0188872   .0055832     3.38   0.001     .0079441    .0298303
   tenkto20k |   .0096083   .0042235     2.27   0.023     .0013302    .0178865
twentykto30k |   .0129734   .0043661     2.97   0.003     .0044156    .0215311
thirtykto40k |   .0098883   .0045413     2.18   0.029     .0009873    .0187894
fourtykto50k |   .0105515   .0046279     2.28   0.023     .0014807    .0196223
 fiftykto75k |   .0066803   .0037548     1.78   0.075    -.0006792    .0140399
    MEDMJLAW |   .0234563   .0025021     9.37   0.000     .0185521    .0283605
       _cons |   .0511442   .0023679    21.60   0.000     .0465031    .0557853
------------------------------------------------------------------------------

. 
. reg marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fiftykto
> 75k MEDMJLAW male

      Source |       SS           df       MS      Number of obs   =    40,989
-------------+----------------------------------   F(8, 40980)     =     13.58
       Model |  6.93533201         8  .866916501   Prob > F        =    0.0000
    Residual |  2615.60164    40,980  .063826297   R-squared       =    0.0026
-------------+----------------------------------   Adj R-squared   =    0.0024
       Total |  2622.53697    40,988  .063983043   Root MSE        =    .25264

------------------------------------------------------------------------------
 marjmthpart |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tenkorlower |   .0189982   .0055834     3.40   0.001     .0080547    .0299418
   tenkto20k |   .0096719   .0042235     2.29   0.022     .0013937    .0179501
twentykto30k |    .013023   .0043661     2.98   0.003     .0044653    .0215806
thirtykto40k |   .0098986   .0045412     2.18   0.029     .0009978    .0187994
fourtykto50k |   .0104653    .004628     2.26   0.024     .0013943    .0195363
 fiftykto75k |   .0066363   .0037548     1.77   0.077    -.0007232    .0139959
    MEDMJLAW |   .0234448   .0025021     9.37   0.000     .0185407    .0283489
        male |   .0044557   .0024967     1.78   0.074     -.000438    .0093493
       _cons |    .048876   .0026874    18.19   0.000     .0436086    .0541433
------------------------------------------------------------------------------

. 
. reg marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fiftykto
> 75k MEDMJLAW black nativeam nativehi asian hispanic multirace

      Source |       SS           df       MS      Number of obs   =    40,989
-------------+----------------------------------   F(13, 40975)    =     15.44
       Model |  12.7832384        13  .983326029   Prob > F        =    0.0000
    Residual |  2609.75373    40,975  .063691366   R-squared       =    0.0049
-------------+----------------------------------   Adj R-squared   =    0.0046
       Total |  2622.53697    40,988  .063983043   Root MSE        =    .25237

------------------------------------------------------------------------------
 marjmthpart |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tenkorlower |   .0206797   .0058055     3.56   0.000     .0093007    .0320586
   tenkto20k |     .01101   .0044317     2.48   0.013     .0023237    .0196962
twentykto30k |   .0145776   .0045146     3.23   0.001     .0057289    .0234263
thirtykto40k |   .0109393   .0046334     2.36   0.018     .0018577    .0200209
fourtykto50k |   .0113605   .0046894     2.42   0.015     .0021691    .0205518
 fiftykto75k |   .0062436   .0037739     1.65   0.098    -.0011532    .0136405
    MEDMJLAW |   .0252512   .0025357     9.96   0.000     .0202811    .0302214
       black |  -.0060064   .0040625    -1.48   0.139     -.013969    .0019562
    nativeam |   .0403535   .0101147     3.99   0.000     .0205285    .0601784
    nativehi |  -.0279476   .0175424    -1.59   0.111    -.0623311    .0064358
       asian |  -.0453571   .0066736    -6.80   0.000    -.0584376   -.0322767
    hispanic |  -.0101556   .0033979    -2.99   0.003    -.0168155   -.0034958
   multirace |   .0211029   .0056616     3.73   0.000     .0100061    .0321996
       _cons |   .0527898   .0024431    21.61   0.000     .0480012    .0575784
------------------------------------------------------------------------------

. 
. reg marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fiftykto
> 75k MEDMJLAW age agesq

      Source |       SS           df       MS      Number of obs   =    40,989
-------------+----------------------------------   F(9, 40979)     =    263.25
       Model |  143.335707         9  15.9261897   Prob > F        =    0.0000
    Residual |  2479.20127    40,979  .060499311   R-squared       =    0.0547
-------------+----------------------------------   Adj R-squared   =    0.0544
       Total |  2622.53697    40,988  .063983043   Root MSE        =    .24597

------------------------------------------------------------------------------
 marjmthpart |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tenkorlower |   .0171329   .0054362     3.15   0.002     .0064777     .027788
   tenkto20k |   .0132205   .0041127     3.21   0.001     .0051595    .0212814
twentykto30k |   .0126814   .0042508     2.98   0.003     .0043497     .021013
thirtykto40k |   .0098808   .0044213     2.23   0.025      .001215    .0185466
fourtykto50k |   .0091206   .0045057     2.02   0.043     .0002895    .0179518
 fiftykto75k |   .0069595   .0036556     1.90   0.057    -.0002055    .0141245
    MEDMJLAW |   .0227115    .002436     9.32   0.000     .0179369    .0274862
         age |  -.0984587   .0142897    -6.89   0.000    -.1264669   -.0704505
       agesq |   .0045539   .0004918     9.26   0.000     .0035901    .0055178
       _cons |   .5078203   .1027375     4.94   0.000     .3064525     .709188
------------------------------------------------------------------------------

. 
. reg marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fiftykto
> 75k MEDMJLAW age13 age14 age15 age16 age17

      Source |       SS           df       MS      Number of obs   =    40,989
-------------+----------------------------------   F(12, 40976)    =    198.62
       Model |  144.156366        12  12.0130305   Prob > F        =    0.0000
    Residual |  2478.38061    40,976  .060483713   R-squared       =    0.0550
-------------+----------------------------------   Adj R-squared   =    0.0547
       Total |  2622.53697    40,988  .063983043   Root MSE        =    .24593

------------------------------------------------------------------------------
 marjmthpart |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tenkorlower |   .0170689   .0054363     3.14   0.002     .0064135    .0277242
   tenkto20k |   .0131902   .0041125     3.21   0.001     .0051296    .0212508
twentykto30k |   .0126988   .0042503     2.99   0.003     .0043682    .0210294
thirtykto40k |   .0097434    .004421     2.20   0.028     .0010781    .0184087
fourtykto50k |   .0088774   .0045059     1.97   0.049     .0000457     .017709
 fiftykto75k |   .0070627   .0036555     1.93   0.053    -.0001021    .0142275
    MEDMJLAW |   .0226287   .0024359     9.29   0.000     .0178543     .027403
       age13 |   .0081559   .0042841     1.90   0.057     -.000241    .0165529
       age14 |   .0320145   .0042622     7.51   0.000     .0236606    .0403685
       age15 |    .071867   .0042538    16.89   0.000     .0635294    .0802045
       age16 |   .1196689   .0042673    28.04   0.000      .111305    .1280329
       age17 |   .1597946   .0043233    36.96   0.000     .1513207    .1682684
       _cons |  -.0142607   .0036726    -3.88   0.000    -.0214591   -.0070623
------------------------------------------------------------------------------

. 
. reg marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fiftykto
> 75k MEDMJLAW male age agesq black nativeam nativehi asian hispanic multirace

      Source |       SS           df       MS      Number of obs   =    40,989
-------------+----------------------------------   F(16, 40972)    =    155.94
       Model |  150.531224        16  9.40820152   Prob > F        =    0.0000
    Residual |  2472.00575    40,972  .060334027   R-squared       =    0.0574
-------------+----------------------------------   Adj R-squared   =    0.0570
       Total |  2622.53697    40,988  .063983043   Root MSE        =    .24563

------------------------------------------------------------------------------
 marjmthpart |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tenkorlower |   .0195494   .0056518     3.46   0.001     .0084719     .030627
   tenkto20k |   .0149133   .0043146     3.46   0.001     .0064566    .0233699
twentykto30k |   .0145055   .0043943     3.30   0.001     .0058926    .0231183
thirtykto40k |   .0111415   .0045098     2.47   0.013     .0023023    .0199807
fourtykto50k |   .0099867   .0045645     2.19   0.029     .0010402    .0189332
 fiftykto75k |   .0064704   .0036732     1.76   0.078    -.0007291    .0136698
    MEDMJLAW |   .0244119   .0024681     9.89   0.000     .0195744    .0292495
        male |   .0041135   .0024277     1.69   0.090    -.0006449    .0088718
         age |  -.0989193   .0142739    -6.93   0.000    -.1268964   -.0709423
       agesq |   .0045742   .0004912     9.31   0.000     .0036114     .005537
       black |  -.0089463   .0039548    -2.26   0.024    -.0166977   -.0011949
    nativeam |    .048069    .009846     4.88   0.000     .0287706    .0673674
    nativehi |  -.0272355   .0170753    -1.60   0.111    -.0607035    .0062325
       asian |  -.0485101   .0064958    -7.47   0.000     -.061242   -.0357781
    hispanic |  -.0101192   .0033074    -3.06   0.002    -.0166017   -.0036367
   multirace |   .0206676   .0055109     3.75   0.000      .009866    .0314691
       _cons |   .5100594   .1026318     4.97   0.000     .3088988      .71122
------------------------------------------------------------------------------

. 
. reg marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fiftykto
> 75k MEDMJLAW male age13 age14 age15 age16 age17 black nativeam nativehi asian hispani
> c multirace

      Source |       SS           df       MS      Number of obs   =    40,989
-------------+----------------------------------   F(19, 40969)    =    132.05
       Model |  151.339449        19  7.96523417   Prob > F        =    0.0000
    Residual |  2471.19752    40,969  .060318717   R-squared       =    0.0577
-------------+----------------------------------   Adj R-squared   =    0.0573
       Total |  2622.53697    40,988  .063983043   Root MSE        =     .2456

------------------------------------------------------------------------------
 marjmthpart |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tenkorlower |   .0194826   .0056517     3.45   0.001     .0084052      .03056
   tenkto20k |   .0148765   .0043144     3.45   0.001     .0064202    .0233327
twentykto30k |   .0145165   .0043937     3.30   0.001     .0059046    .0231283
thirtykto40k |   .0109953   .0045095     2.44   0.015     .0021566    .0198339
fourtykto50k |   .0097468   .0045648     2.14   0.033     .0007997     .018694
 fiftykto75k |   .0065714    .003673     1.79   0.074    -.0006278    .0137706
    MEDMJLAW |   .0243237   .0024679     9.86   0.000     .0194865    .0291609
        male |   .0041625   .0024275     1.71   0.086    -.0005954    .0089204
       age13 |   .0080551   .0042785     1.88   0.060    -.0003308     .016441
       age14 |    .032062   .0042571     7.53   0.000     .0237179     .040406
       age15 |   .0723482   .0042492    17.03   0.000     .0640196    .0806768
       age16 |   .1197902    .004262    28.11   0.000     .1114365    .1281439
       age17 |   .1604602   .0043185    37.16   0.000     .1519958    .1689246
       black |  -.0090082   .0039544    -2.28   0.023     -.016759   -.0012575
    nativeam |   .0478535    .009845     4.86   0.000      .028557    .0671499
    nativehi |   -.027329   .0170735    -1.60   0.109    -.0607934    .0061355
       asian |  -.0485645   .0064952    -7.48   0.000    -.0612953   -.0358338
    hispanic |  -.0100493   .0033071    -3.04   0.002    -.0165313   -.0035673
   multirace |   .0206174   .0055103     3.74   0.000     .0098171    .0314178
       _cons |  -.0146051   .0039113    -3.73   0.000    -.0222714   -.0069387
------------------------------------------------------------------------------

. 
. *logit marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fifty
> kto75k MEDMJLAW male
. *mfx
. 
. *logit marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fifty
> kto75k MEDMJLAW black nativeam nativehi asian hispanic multirace
. *mfx
. 
. logit marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fiftyk
> to75k MEDMJLAW male age agesq black nativeam nativehi asian hispanic multirace

Iteration 0:   log likelihood = -10258.183  
Iteration 1:   log likelihood = -9325.1164  
Iteration 2:   log likelihood = -8976.8042  
Iteration 3:   log likelihood = -8958.5212  
Iteration 4:   log likelihood = -8958.2934  
Iteration 5:   log likelihood = -8958.2934  

Logistic regression                             Number of obs     =     40,989
                                                LR chi2(16)       =    2599.78
                                                Prob > chi2       =     0.0000
Log likelihood = -8958.2934                     Pseudo R2         =     0.1267

------------------------------------------------------------------------------
 marjmthpart |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tenkorlower |   .3238557    .088944     3.64   0.000     .1495288    .4981826
   tenkto20k |    .256817   .0713969     3.60   0.000     .1168816    .3967524
twentykto30k |   .2442907   .0717052     3.41   0.001      .103751    .3848304
thirtykto40k |   .1851298   .0742778     2.49   0.013     .0395481    .3307116
fourtykto50k |   .1753964   .0749224     2.34   0.019     .0285512    .3222416
 fiftykto75k |   .1178713   .0617456     1.91   0.056    -.0031479    .2388906
    MEDMJLAW |   .4020982   .0410534     9.79   0.000      .321635    .4825615
        male |   .0717087   .0403743     1.78   0.076    -.0074234    .1508408
         age |    4.50973   .3862172    11.68   0.000     3.752759    5.266702
       agesq |  -.1269505   .0125816   -10.09   0.000    -.1516101    -.102291
       black |  -.1470446     .06594    -2.23   0.026    -.2762847   -.0178045
    nativeam |   .6393631   .1337922     4.78   0.000     .3771352     .901591
    nativehi |   -.489734   .3178787    -1.54   0.123    -1.112765    .1332968
       asian |  -1.077891    .154411    -6.98   0.000    -1.380531   -.7752507
    hispanic |  -.1655366    .055121    -3.00   0.003    -.2735718   -.0575014
   multirace |   .2845038    .081071     3.51   0.000     .1256076    .4433999
       _cons |  -41.92426    2.95117   -14.21   0.000    -47.70845   -36.14007
------------------------------------------------------------------------------

. mfx

Marginal effects after logit
      y  = Pr(marjmthpart) (predict)
         =  .03613329
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
tenkor~r*|   .0129167      .00405    3.19   0.001   .004982  .020852   .057357
tenk~20k*|   .0098263        .003    3.27   0.001   .003942  .015711   .112689
twen~30k*|   .0093225        .003    3.11   0.002   .003445    .0152   .103638
thir~40k*|   .0069198      .00298    2.32   0.020   .001078  .012761   .093806
four~50k*|   .0065359      .00299    2.19   0.029    .00068  .012392   .089561
fift~75k*|   .0042649      .00232    1.84   0.066  -.000287  .008816   .154505
MEDMJLAW*|   .0142104      .00152    9.32   0.000   .011223  .017198   .475005
    male*|   .0024964      .00141    1.77   0.076   -.00026  .005253   .509137
     age |   .1570634      .01081   14.53   0.000    .13588  .178246    14.524
   agesq |  -.0044214      .00036  -12.13   0.000  -.005136 -.003707   213.771
   black*|  -.0048718      .00208   -2.34   0.019   -.00895 -.000793   .129401
nativeam*|   .0299295      .00819    3.66   0.000   .013882  .045977   .015858
nativehi*|  -.0137093      .00703   -1.95   0.051  -.027481  .000062   .005123
   asian*|  -.0244623      .00224  -10.91   0.000  -.028856 -.020069   .037669
hispanic*|  -.0055226      .00177   -3.12   0.002  -.008988 -.002058   .214521
multir~e*|   .0111688      .00358    3.12   0.002   .004149  .018189   .053966
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

. 
. *probit marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fift
> ykto75k MEDMJLAW male
. *mfx
. 
. *probit marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fift
> ykto75k MEDMJLAW black nativeam nativehi asian hispanic multirace
. *mfx
. 
. probit marjmthpart tenkorlower tenkto20k twentykto30k thirtykto40k fourtykto50k fifty
> kto75k MEDMJLAW male age agesq black nativeam nativehi asian hispanic multirace

Iteration 0:   log likelihood = -10258.183  
Iteration 1:   log likelihood = -9094.8227  
Iteration 2:   log likelihood = -8959.4032  
Iteration 3:   log likelihood = -8956.5929  
Iteration 4:   log likelihood = -8956.5894  
Iteration 5:   log likelihood = -8956.5894  

Probit regression                               Number of obs     =     40,989
                                                LR chi2(16)       =    2603.19
                                                Prob > chi2       =     0.0000
Log likelihood = -8956.5894                     Pseudo R2         =     0.1269

------------------------------------------------------------------------------
 marjmthpart |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 tenkorlower |   .1767807   .0457764     3.86   0.000     .0870606    .2665008
   tenkto20k |    .148751   .0361452     4.12   0.000     .0779077    .2195943
twentykto30k |   .1368262   .0364987     3.75   0.000     .0652902    .2083623
thirtykto40k |   .0990072   .0378567     2.62   0.009     .0248095     .173205
fourtykto50k |   .0942986   .0381609     2.47   0.013     .0195047    .1690925
 fiftykto75k |   .0607052   .0313753     1.93   0.053    -.0007893    .1221996
    MEDMJLAW |   .2029278   .0208298     9.74   0.000     .1621022    .2437534
        male |   .0308904    .020533     1.50   0.132    -.0093535    .0711343
         age |   1.635499   .1687685     9.69   0.000     1.304719    1.966279
       agesq |  -.0437097   .0055654    -7.85   0.000    -.0546178   -.0328016
       black |  -.0800141   .0333698    -2.40   0.016    -.1454178   -.0146105
    nativeam |   .3426147   .0715712     4.79   0.000     .2023377    .4828917
    nativehi |  -.2538515   .1557882    -1.63   0.103    -.5591908    .0514878
       asian |   -.529898    .070983    -7.47   0.000    -.6690222   -.3907739
    hispanic |  -.0839737   .0278073    -3.02   0.003    -.1384749   -.0294725
   multirace |   .1421914   .0427348     3.33   0.001     .0584329      .22595
       _cons |  -16.30334   1.272794   -12.81   0.000    -18.79797   -13.80871
------------------------------------------------------------------------------

. mfx

Marginal effects after probit
      y  = Pr(marjmthpart) (predict)
         =  .04011112
------------------------------------------------------------------------------
variable |      dy/dx    Std. Err.     z    P>|z|  [    95% C.I.   ]      X
---------+--------------------------------------------------------------------
tenkor~r*|   .0174953      .00514    3.40   0.001   .007416  .027574   .057357
tenk~20k*|   .0142105       .0038    3.74   0.000   .006763  .021657   .112689
twen~30k*|   .0129934      .00379    3.42   0.001   .005556   .02043   .103638
thir~40k*|   .0091741      .00376    2.44   0.015   .001814  .016535   .093806
four~50k*|   .0087146      .00377    2.31   0.021   .001333  .016096   .089561
fift~75k*|   .0054394      .00292    1.87   0.062  -.000274  .011153   .154505
MEDMJLAW*|   .0177444      .00187    9.50   0.000   .014083  .021406   .475005
    male*|   .0026668      .00177    1.50   0.132  -.000808  .006141   .509137
     age |   .1412552      .01305   10.83   0.000   .115685  .166826    14.524
   agesq |  -.0037751      .00044   -8.57   0.000  -.004638 -.002912   213.771
   black*|  -.0065622       .0026   -2.53   0.012  -.011653 -.001472   .129401
nativeam*|    .039299      .01047    3.75   0.000   .018785  .059813   .015858
nativehi*|  -.0175785      .00841   -2.09   0.037  -.034064 -.001093   .005123
   asian*|  -.0299341      .00245  -12.23   0.000   -.03473 -.025139   .037669
hispanic*|  -.0069572      .00221   -3.15   0.002  -.011291 -.002624   .214521
multir~e*|   .0137155      .00458    3.00   0.003    .00474  .022691   .053966
------------------------------------------------------------------------------
(*) dy/dx is for discrete change of dummy variable from 0 to 1

. 
end of do-file

. do "/var/folders/bq/_s8vbhy91kz3b858vc4j4bqw0000gn/T//SD34985.000000"

. * Datafile used: NSDUHcleanfinal.dta
. * Author: David Wan
. * Date: November 6, 2018
. * Sample Size: n=20584
. * Data source: NSDHU 2014-2016 cycles
. capture log close
